Repository: Blezz-tech/kp11-conspects
Catalog: src/src-omegat.tmx
Source language: en_us
Languages: ru_ru

source: So we can call it as an infix function by doing ``92 `div` 10`` and suddenly it's much clearer.
ru_ru: Таким образом, мы можем вызвать это как инфиксную функцию, выполнив команду ``92 `div` 10``, и внезапно все становится намного понятнее.

source: So what if we wanted to put a couple of vectors in a list to represent points of a shape on a two-dimensional plane?
ru_ru: Итак, что, если бы мы захотели поместить пару векторов в список для представления точек фигуры на двумерной плоскости?

source: Speaking of characters, strings are just lists of characters.
ru_ru: Говоря о символах, строки - это просто списки символов.

source: Success!
ru_ru: Успех!

source: Sure, we could just type them all out but obviously that's not a solution for gentlemen who demand excellence from their programming languages.
ru_ru: Конечно, мы могли бы просто напечатать их все, но, очевидно, это не решение для джентльменов, которые требуют совершенства от своих языков программирования.

source: Sure, you could do `[13,26..24*13]`.
ru_ru: Конечно, вы могли бы сделать `[13,26..24*13]`.

source: Surprise!
ru_ru: Сюрприз!

source: Testing for equality is done like so.
ru_ru: Проверка на равенство выполняется следующим образом.

source: Testing it out produces pretty predictable results (remember to append this function to the `baby.hs` file, save it and then do `:l baby` inside GHCI).
ru_ru: Тестирование дает довольно предсказуемые результаты (не забудьте добавить эту функцию в файл `baby.hs`, сохранить его, а затем выполнить `:l baby` внутри GHCI).

source: Testing it out:
ru_ru: Проверяю это на практике:

source: That apostrophe doesn't have any special meaning in Haskell's syntax.
ru_ru: Этот апостроф не имеет никакого особого значения в синтаксисе Haskell.

source: That goes well with referential transparency and it allows you to think of programs as a series of **transformations on data**.
ru_ru: Это хорошо сочетается со ссылочной прозрачностью и позволяет вам думать о программах как о серии **преобразований данных**.

source: That is the equivalent of writing `[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]` and there's no difference between writing one or the other except that writing out long enumeration sequences manually is stupid.
ru_ru: Это эквивалентно написанию `[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]`, и нет никакой разницы между написанием одного или другого, за исключением того, что записывать длинные последовательности перечисления вручную глупо.

source: That means that a lot of possible errors are caught at compile time.
ru_ru: Это означает, что во время компиляции обнаруживается множество возможных ошибок.

source: That means that the set contains the doubles of all natural numbers that satisfy the predicate.
ru_ru: Это означает, что множество содержит удвоения всех натуральных чисел, которые удовлетворяют предикату.

source: That means that unless specifically told otherwise, Haskell won't execute functions and calculate things until it's really forced to show you a result.
ru_ru: Это означает, что, если специально не указано иное, Haskell не будет выполнять функции и вычислять что-либо, пока его действительно не заставят показать вам результат.

source: That means that we can have a list of integers or a list of characters but we can't have a list that has a few integers and then a few characters.
ru_ru: Это означает, что у нас может быть список целых чисел или список символов, но у нас не может быть списка, состоящего из нескольких целых чисел, а затем нескольких символов.

source: That means that you don't have to explicitly label every piece of code with a type because the type system can intelligently figure out a lot about it.
ru_ru: Это означает, что вам не нужно явно помечать каждый фрагмент кода типом, потому что система типов может разумно многое выяснить об этом.

source: That way when you want something from a lazy language you can just take some initial data and efficiently transform and mend it so it resembles what you want at the end.
ru_ru: Таким образом, когда вам нужно что-то из ленивого языка, вы можете просто взять некоторые исходные данные и эффективно преобразовать и исправить их, чтобы они напоминали то, что вы хотите в конце.

source: That would kind of work.
ru_ru: Это вроде как сработало бы.

source: That's because functions can't begin with uppercase letters.
ru_ru: Это потому, что функции не могут начинаться с заглавных букв.

source: That's called referential transparency and not only does it allow the compiler to reason about the program's behavior, but it also allows you to easily deduce (and even prove) that a function is correct and then build more complex functions by gluing simple functions together.
ru_ru: Это называется прозрачностью ссылок, и она не только позволяет компилятору рассуждать о поведении программы, но и позволяет вам легко вывести (и даже доказать), что функция верна, а затем создавать более сложные функции путем склеивания простых функций вместе.

source: That's its type and it doesn't matter if it has only one number in it or an infinite amount of numbers.
ru_ru: Это его тип, и не имеет значения, содержит ли он только одно число или бесконечное количество чисел.

source: That's not a problem when dealing with lists that aren't too big.
ru_ru: Это не проблема, когда имеешь дело со списками, которые не слишком велики.

source: The `succ` function takes anything that has a defined successor and returns that successor.
ru_ru: Функция `succ` принимает все, что имеет определенного преемника, и возвращает этого преемника.^[Преемник (successor) - это число, следующее после некоторого натурального числа. <br> Форма: Число + 1 = Преемник <br> Функция приемника (successor function) - это функция, которая отправляет натуральное число следующему. <br> Формула: f(x) = x + 1]

source: The alphabet is an enumeration of characters from A to Z. Names can't be enumerated.
ru_ru: Алфавит - это перечисление символов от `A` до `Z`^[Стандарт вышел 10 лет назад и он сохраняет обратную совместимость. Поэтому, чтобы использовать unicode, нужно провести небольшие манипуляции. Об этом можно поискать в интернете. "ghci how add utf 8"]. Имена не могут быть пронумерованы.

source: The best way to get started is to download the [Haskell Platform](http://hackage.haskell.org/platform/), which is basically Haskell with batteries included.
ru_ru: Лучший способ начать - это загрузить [Haskell Platform](http://hackage.haskell.org/platform/), который в основном представляет собой Haskell с включенными батарейками.

source: The channel #haskell on the freenode network is a great place to ask questions if you're feeling stuck.
ru_ru: Канал #haskell в сети freenode - отличное место, чтобы задать вопросы, если вы чувствуете себя застрявшим.

source: The difference between Haskell's if statement and if statements in imperative languages is that the else part is mandatory in Haskell.
ru_ru: Разница между оператором `if` в Haskell и операторами `if` в императивных языках заключается в том, что часть `else` является обязательной в Haskell.

source: The element is included in the list only if all the predicates evaluate to `True`.
ru_ru: Элемент включается в список только в том случае, если все предикаты оцениваются как `True`.

source: The factorial of a number is the product of all the numbers from 1 to that number, the sum of a list of numbers is the first number plus the sum of all the other numbers, and so on.
ru_ru: Факториал числа - это произведение всех чисел от 1 до этого числа, сумма списка чисел - это первое число плюс сумма всех остальных чисел и так далее.

source: The first element goes with the first, the second with the second, etc.
ru_ru: Первый элемент сочетается с первым, второй - со вторым и т.д.

source: The first is that in the function name we didn't capitalize Conan's name.
ru_ru: Во-первых, мы не написали имя функции с заглавной буквы.

source: The first one is an empty list, the seconds one is a list that contains one empty list, the third one is a list that contains three empty lists.
ru_ru: Первый - это пустой список, второй - это список, содержащий один пустой список, третий - это список, содержащий три пустых списка.

source: The first one sees that and tells you the first element is 8.
ru_ru: Первая видит это и сообщает вам, что первый элемент равен 8.

source: The first thing we're going to do is run ghc's interactive mode and call some function to get a very basic feel for haskell.
ru_ru: Первое, что мы собираемся сделать, это запустить интерактивный режим ghc и вызвать какую-нибудь функцию, чтобы получить самое базовое представление о Haskell.

source: The function `odd` returns `True` on an odd number and `False` on an even one.
ru_ru: Функция `odd` возвращает `True` для нечетного числа и `False` для четного.

source: The function name is followed by parameters seperated by spaces.
ru_ru: За именем функции следуют параметры, разделенные пробелами.

source: The functions `min` and `max` take two things that can be put in an order (like numbers!).
ru_ru: Функции `min` и `max` используют две вещи, которые можно упорядочить (например, числа!).

source: The head of a list is basically its first element.
ru_ru: Заголовок списка - это, по сути, его первый элемент.

source: The indices start at 0.
ru_ru: Индексы начинаются с 0.

source: The interactive mode is invoked by typing in `ghci` at your prompt.
ru_ru: Интерактивный режим вызывается путем ввода `ghci` в вашей командной строке.

source: The last part of the comprehension is the predicate.
ru_ru: Последняя часть спискового включения - это предикат.

source: The list comprehension we could use is `[x*2 | x <- [1..10]]`.
ru_ru: Списковое включение, которое мы могли бы использовать, - это `[x * 2 | x <- [1..10]]`.

source: The lists within a list can be of different lengths but they can't be of different types.
ru_ru: Списки внутри списка могут быть разной длины, но они не могут быть разных типов.

source: The longer list simply gets cut off to match the length of the shorter one.
ru_ru: Более длинный список просто обрезается, чтобы соответствовать длине более короткого.

source: The only thing a function can do is calculate something and return it as a result.
ru_ru: Единственное, что может сделать функция, - это вычислить что-то и вернуть это в результате.

source: The part before the pipe is called the output function, `x` is the variable, `N` is the input set and `x <= 10` is the predicate.
ru_ru: Часть перед вертикальной чертой называется выходной функцией, `x` - это переменная, `N` - это входной набор, а `x <= 10` - это предикат^[Предикат - если просто, то это условие].

source: The predicate here does all the work.
ru_ru: Предикат здесь выполняет всю работу.

source: The problem with that method is that we could also do stuff like `[[1,2],[8,11,5],[4,5]]`, which Haskell has no problem with since it's still a list of lists with numbers but it kind of doesn't make sense.
ru_ru: Проблема с этим методом заключается в том, что мы также могли бы делать такие вещи, как `[[1,2],[8,11,5],[4,5]]`, с чем у Haskell нет проблем, поскольку это все еще список списков с числами, но это как бы не имеет смысла.

source: The prompt here is `Prelude>` but because it can get longer when you load stuff into the session, we're going to use `ghci>`.
ru_ru: Подсказка здесь `Prelude>`, но поскольку она может стать длиннее, когда вы загружаете материал в сеанс, мы собираемся использовать `ghci>`.

source: The second one receives that and gives back 4 to the first one.
ru_ru: Вторая получает это и возвращает 4 первой.

source: The second one says that to the third one and the third one reluctantly gives back a doubled 1, which is a 2.
ru_ru: Вторая скажет это третьей, и третья неохотно возвращает удвоенную 1, которая равна 2.

source: The second thing is that this function doesn't take any parameters.
ru_ru: Во-вторых, эта функция не принимает никаких параметров.

source: The usual workflow for me when playing around in stuff is defining some functions in a .hs file, loading it up and messing around with them and then changing the .hs file, loading it up again and so on.
ru_ru: Обычный рабочий процесс для меня, когда я копаюсь в материалах, - это определение некоторых функций в файле .hs, его загрузка и возня с ними, а затем изменение файла .hs, повторная загрузка и так далее.

source: The way I learned it was by reading several different tutorials and articles because each explained something in a different way than the other did.
ru_ru: Я научился, прочитав несколько разных учебников и статей, потому что каждый объяснял что-то по другому, чем другой.

source: Then it would pass through the list another two times and return the result.
ru_ru: Затем он пройдет по списку еще два раза и вернет результат.

source: There are quite a few tutorials on Haskell floating around on the internet.
ru_ru: В Интернете есть довольно много учебных пособий по Haskell.

source: There are two noteworthy things here.
ru_ru: Здесь есть две заслуживающие внимания вещи.

source: They are denoted with parentheses and their components are separated by commas.
ru_ru: Они обозначаются круглыми скобками, а их компоненты разделяются запятыми.

source: They can also contain lists that contain lists that contain lists …
ru_ru: Они также могут содержать списки, которые содержат списки, которые содержат списки ...

source: They won't work on triples, 4-tuples, 5-tuples, etc.
ru_ru: Они не будут работать с тройками, 4-кортежами, 5-кортежами и т.д.

source: They're normally used for building more specific sets out of general sets.
ru_ru: Обычно они используются для построения более специфичных наборов из общих наборов.

source: Think about how we'd represent a two-dimensional vector in Haskell.
ru_ru: Подумайте о том, как бы мы представили двумерный вектор в Haskell.

source: This error cannot be caught at compile time so it's always good practice to take precautions against accidentally telling Haskell to give you some elements from an empty list.
ru_ru: Эта ошибка не может быть обнаружена во время компиляции, поэтому всегда рекомендуется принимать меры предосторожности, чтобы случайно не попросить Haskell предоставить вам некоторые элементы из пустого списка.

source: This function replaces every element of a list with `1` and then sums that up.
ru_ru: Эта функция заменяет каждый элемент списка на `1`, а затем суммирует его.

source: This is a common pattern in functional programming.
ru_ru: Это распространенный шаблон в функциональном программировании.

source: This is a very simple example of a common pattern you will see throughout Haskell.
ru_ru: Это очень простой пример общего шаблона, который вы увидите во всем Haskell.

source: This is also what we'll be doing here.
ru_ru: Это тоже то, чем мы будем заниматься здесь.

source: This is done by using the `++` operator.
ru_ru: Это делается с помощью оператора `++`.

source: This is pretty self-explanatory.
ru_ru: Это говорит само за себя.

source: This is what we call an _infix_ function.
ru_ru: Это то, что мы называем _инфиксной_ функцией.

source: This means that the resulting sum will be the length of our list.
ru_ru: Это означает, что результирующая сумма будет равна длине нашего списка.

source: This tutorial is aimed at people who have experience in imperative programming languages (C, C++, Java, Python …) but haven't programmed in a functional language before (Haskell, ML, OCaml …).
ru_ru: Это руководство предназначено для людей, которые имеют опыт работы с императивными языками программирования (C, C ++, Java, Python ...), но никогда раньше не программировали на функциональном языке (Haskell, ML, OCaml вЂ/).

source: This way you also avoid repetition.
ru_ru: Таким образом, вы также избежите повторения.

source: Those were a few basic functions that operate on lists.
ru_ru: Это было несколько основных функций, которые работают со списками.

source: To make a list containing all the natural numbers from 1 to 20, you just write `[1..20]`.
ru_ru: Чтобы составить список, содержащий все натуральные числа от 1 до 20, вы просто пишете `[1..20]`.

source: To make a list with all the numbers from 20 to 1, you can't just do `[20..1]`, you have to do `[20,19..1]`.
ru_ru: Чтобы составить список со всеми числами от 20 до 1, вы не можете просто выполнить `[20..1]`, вы должны выполнить `[20,19..1]`.

source: Tuples are much more rigid because each different size of tuple is its own type, so you can't write a general function to append an element to a tuple — you'd have to write a function for appending to a pair, one function for appending to a triple, one function for appending to a 4-tuple, etc.
ru_ru: Кортежи намного более жесткие, потому что каждый кортеж разного размера имеет свой собственный тип, поэтому вы не можете написать общую функцию для добавления элемента к кортежу — вам пришлось бы написать функцию для добавления к паре, одну функцию для добавления к тройке, одну функцию для добавления к 4-му кортежу и т.д.

source: Tuples can also be used to represent a wide variety of data.
ru_ru: Кортежи также могут использоваться для представления самых разнообразных данных.

source: Tuples, however, are used when you know exactly how many values you want to combine and its type depends on how many components it has and the types of the components.
ru_ru: Однако кортежи используются, когда вы точно знаете, сколько значений вы хотите объединить, а их тип зависит от того, сколько в нем компонентов и типов компонентов.

source: Two useful functions that operate on pairs:
ru_ru: Две полезные функции, которые работают с парами:

source: Type inference also allows your code to be more general.
ru_ru: Вывод типа также позволяет вашему коду быть более общим.

source: Unlike a list, a tuple can contain a combination of several types.
ru_ru: В отличие от списка, кортеж может содержать комбинацию нескольких типов.

source: Use this function instead of `xs == []` (if you have a list called `xs`)
ru_ru: Используйте эту функцию вместо `xs == []` (если у вас есть список с именем `xs`)

source: Use tuples when you know in advance how many components some piece of data should have.
ru_ru: Используйте кортежи, когда вы заранее знаете, сколько компонентов должно быть в том или ином фрагменте данных.

source: Watch out when repeatedly using the `++` operator on long strings.
ru_ru: Будьте осторожны при повторном использовании оператора `++` для длинных строк.

source: Watch out when using floating point numbers in ranges!
ru_ru: Будьте осторожны при использовании чисел с плавающей запятой в диапазонах!

source: Watch.
ru_ru: Посмотри.

source: We can also use several operators on one line and all the usual precedence rules are obeyed.
ru_ru: Мы также можем использовать несколько операторов в одной строке, и при этом соблюдаются все обычные правила приоритета.

source: We can include several predicates.
ru_ru: Мы можем включить несколько предикатов.

source: We can use parentheses to make the precedence explicit or to change it.
ru_ru: Мы можем использовать круглые скобки, чтобы сделать приоритет явным или изменить его.

source: We could do something like `[[1,2],[8,11],[4,5]]`.
ru_ru: Мы могли бы сделать что-то вроде `[[1,2],[8,11],[4,5]]`.

source: We could have also defined it as `doubleUs x y = x + x + y + y`.
ru_ru: Мы могли бы также определить это как `doubleUs x y = x + x + y + y`.

source: We could have also written that if statement in one line but I find this way more readable.
ru_ru: Мы могли бы также написать это выражение `if` в одной строке, но я нахожу этот способ более читабельным.

source: We could use a list comprehension for that.
ru_ru: Для этого мы могли бы использовать списковое включение.

source: We took a list of numbers and we filtered them by the predicate.
ru_ru: Мы взяли список чисел и отфильтровали их по предикату.

source: We usually use `'` to either denote a strict version of a function (one that isn't lazy) or a slightly modified version of a function or a variable.
ru_ru: Обычно мы используем `'` либо для обозначения строгой версии функции (той, которая не является ленивой), либо для слегка измененной версии функции или переменной.

source: We'd have to write `succ (9 * 10)` to get 91.
ru_ru: Нам пришлось бы написать `succ (9 * 10)`, чтобы получить 91.

source: We'll also modify this function by taking into consideration that side b isn't larger than the hypothenuse and that side a isn't larger than side b.
ru_ru: Мы также модифицируем эту функцию, принимая во внимание, что сторона `b` не больше гипотенузы и что сторона `a` не больше стороны `b`.

source: We'll call it `length'`.
ru_ru: Мы будем называть это `length'`.

source: We'll go over extracting data from tuples in different ways a bit later.
ru_ru: Чуть позже мы рассмотрим извлечение данных из кортежей различными способами.

source: We'll see why a bit later.
ru_ru: Мы поймем, почему, чуть позже.

source: We'll stick to getting the first 10 even numbers for now.
ru_ru: Пока мы будем придерживаться получения первых 10 четных чисел.

source: We'll take a closer look at types a bit later.
ru_ru: Мы подробнее рассмотрим типы чуть позже.

source: We'll take a look at more list functions [later](http://learnyouahaskell.com/modules#data-list)
ru_ru: Мы рассмотрим дополнительные функции списка [позже](http://learnyouahaskell.com/modules#data-list)

source: We're almost done.
ru_ru: Мы почти закончили.

source: We're just drawing from three lists and our output function is combining them into a triple.
ru_ru: Мы просто рисуем из трех списков, и наша функция вывода объединяет их в тройку.

source: Welcome to **Learn You a Haskell for Great Good**!
ru_ru: Добро пожаловать в **Выучи Haskell для Великого Блага**!

source: Well, if we try the first snippet, we get a big scary error message!
ru_ru: Что ж, если мы попробуем первый фрагмент, то получим большое пугающее сообщение об ошибке!

source: Well, we'd get this error:
ru_ru: Ну, мы бы получили эту ошибку:

source: Well, you've come to the right place, but let's talk about this tutorial a bit first.
ru_ru: Что ж, вы обратились по адресу, но давайте немного поговорим об этом уроке.

source: What GHCI is telling us here is that `"llama"` is not a number and so it doesn't know how to add it to 5.
ru_ru: GHCI говорит нам здесь, что "llama" - это не число, и поэтому он не знает, как добавить его к 5.

source: What about doing `5 + "llama"` or `5 == True`?
ru_ru: Как насчет того, чтобы сделать `5 + "llama"` или `5 == True`?

source: What are you, some kind of liar?
ru_ru: Ты что, какой-то лжец?

source: What comes after "John"?
ru_ru: Что следует за словом "John"?

source: What else can you do with lists?
ru_ru: Что еще вы можете сделать со списками?

source: What happens if the lengths of the lists don't match?
ru_ru: Что произойдет, если длины списков не совпадут?

source: What if some mathematicians figured out that 2 is actually 3 and you had to change your program?
ru_ru: Что, если бы какие-нибудь математики выяснили, что 2 на самом деле равно 3, и вам пришлось бы изменить свою программу?

source: What if we tried to make a shape like `[(1,2),(8,11,5),(4,5)]`?
ru_ru: Что, если бы мы попытались создать форму, подобную `[(1,2),(8,11,5),(4,5)]`?

source: What if we want a list of all numbers between 1 and 20?
ru_ru: Что, если нам нужен список всех чисел от 1 до 20?

source: What if we want all even numbers between 1 and 20?
ru_ru: Что, если нам нужны все четные числа от 1 до 20?

source: What if we wanted all possible products that are more than 50?
ru_ru: Что, если бы нам понадобились все возможные произведения, которых более 50?

source: What that means for us is that these two statements are equivalent.
ru_ru: Для нас это означает, что эти два утверждения эквивалентны.
